workspace/InformationRegisters/АукРасчетИтоговРезультаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>АукРасчетИтоговРезультаты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РезультатРасчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчастникВыбран</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоПобедитель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Аукцион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукАукционы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЭтапа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукУчастникиАукционов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаДанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

workspace/InformationRegisters/АукИсторияДанныхАукционов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>АукИсторияДанныхАукционов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеЭлементаДанных</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.АукЭлементыДанныхАукционов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НаправлениеДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АукНаправленияДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АукВидыДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукКонтактныеЛицаУчастниковАукционов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЭтапа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Аукцион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукАукционы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукУчастникиАукционов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаДанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭлементДанных</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АукЭлементыДанныхАукционов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

workspace/Catalogs/АукАукционы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>АукАукционы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидАукциона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукВидыАукционов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийАукцион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукАукционы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическийСтарт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическийПереходКПодведениюПромежуточныхИтогов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическоеПодведениеПромежуточныхИтогов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическийПереходКПодведениюОкончательныхИтогов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическоеПодведениеОкончательныхИтогов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Участники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АукУчастникиАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АукКонтактныеЛицаУчастниковАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НачальныеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АукУчастникиАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаНачальныхДанных</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭлементНачальныхДанных</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АукЭлементыДанныхАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеНачальныхДанных</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.АукЭлементыДанныхАукционов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Этапы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлительностьДни</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлительностьЧасы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АукЭлементыДанныхАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.АукЭлементыДанныхАукционов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

workspace/InformationRegisters/АукРасчетИтоговРезультаты/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ДобавитьЗаписи(пМассивСтруктур) Экспорт
	
	сткРез = АукОбщийСервер.ДобавитьЗаписиВРегистрСведений(пМассивСтруктур, "АукРасчетИтоговРезультаты"); 
	
	Если Не сткРез.Успех Тогда	
		ВызватьИсключение сткРез.Ошибка;		
	КонецЕсли;
	
КонецПроцедуры

Функция ПодготовитьДанныеДляЗаписи(пСткПараметры) Экспорт
	масРезультат = Новый Массив;
	
	Для Каждого сткРезультатыРасчета Из пСткПараметры.РезультатыРасчета Цикл	
		сткЗапись = Новый Структура;
		
		сткЗапись.Вставить("Аукцион",		пСткПараметры.Аукцион);
		сткЗапись.Вставить("НомерЭтапа",	пСткПараметры.НомерЭтапа);
		
		сткЗапись.Вставить("Участник",		сткРезультатыРасчета.Участник);
		сткЗапись.Вставить("СтрокаДанных",	сткРезультатыРасчета.СтрокаДанных);
		
		сткЗапись.Вставить("РезультатРасчета",	сткРезультатыРасчета.РезультатРасчета);
		сткЗапись.Вставить("УчастникВыбран",	сткРезультатыРасчета.УчастникВыбран);
		сткЗапись.Вставить("ЭтоПобедитель",		сткРезультатыРасчета.ЭтоПобедитель);
		
		сткЗапись.Вставить("Автор",			пСткПараметры.Автор);
		сткЗапись.Вставить("ДатаЗаписи",	пСткПараметры.ТекДата);
		
		масРезультат.Добавить(сткЗапись);	
	КонецЦикла;	
	
	Возврат масРезультат;
КонецФункции

Функция СохраненныеДанныеРезультатовРасчетаИтоговАукционаПоЭтапу(пАукцион, пНомерЭтапа) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукРасчетИтоговРезультаты.Участник КАК Участник,
	|	АукРасчетИтоговРезультаты.СтрокаДанных КАК СтрокаДанных,
	|	АукРасчетИтоговРезультаты.РезультатРасчета КАК РезультатРасчета,
	|	АукРасчетИтоговРезультаты.УчастникВыбран КАК УчастникВыбран,
	|	АукРасчетИтоговРезультаты.ЭтоПобедитель КАК ЭтоПобедитель
	|ИЗ
	|	РегистрСведений.АукРасчетИтоговРезультаты КАК АукРасчетИтоговРезультаты
	|ГДЕ
	|	АукРасчетИтоговРезультаты.Аукцион = &Аукцион
	|	И АукРасчетИтоговРезультаты.НомерЭтапа = &НомерЭтапа";	
	
	Запрос.УстановитьПараметр("Аукцион",	пАукцион);
	Запрос.УстановитьПараметр("НомерЭтапа",	пНомерЭтапа);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе		
		Возврат РезультатЗапроса.Выгрузить();	
	КонецЕсли;	
КонецФункции

Функция ДанныеСтавкиПобедителя(пСткОтбор) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукАукционы.Ссылка КАК Аукцион,
	|	Аук_ВидыАукционовСтруктураСтавки.НомерСтроки КАК НомерСтроки,
	|	Аук_ВидыАукционовСтруктураСтавки.ЭлементСтавки КАК ЭлементСтавки
	|ПОМЕСТИТЬ втСтруктураСтавкиПоАукциону
	|ИЗ
	|	Справочник.АукАукционы КАК АукАукционы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АукВидыАукционов.СтруктураСтавки КАК Аук_ВидыАукционовСтруктураСтавки
	|		ПО АукАукционы.ВидАукциона = Аук_ВидыАукционовСтруктураСтавки.Ссылка
	|ГДЕ
	|	АукАукционы.Ссылка = &Аукцион
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АукЭлементыДанныхАукционов.Представление КАК ЭлементДанныхПредставление,
	|	Аук_ИсторияДанныхАукционовСрезПоследних.ЗначениеЭлементаДанных КАК ЗначениеЭлементаДанных
	|ИЗ
	|	втСтруктураСтавкиПоАукциону КАК втСтруктураСтавкиПоАукциону
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АукИсторияДанныхАукционов.СрезПоследних КАК Аук_ИсторияДанныхАукционовСрезПоследних
	|		ПО втСтруктураСтавкиПоАукциону.Аукцион = Аук_ИсторияДанныхАукционовСрезПоследних.Аукцион
	|			И втСтруктураСтавкиПоАукциону.ЭлементСтавки = Аук_ИсторияДанныхАукционовСрезПоследних.ЭлементДанных
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АукРасчетИтоговРезультаты КАК АукРасчетИтоговРезультаты
	|		ПО (Аук_ИсторияДанныхАукционовСрезПоследних.Аукцион = АукРасчетИтоговРезультаты.Аукцион)
	|			И (Аук_ИсторияДанныхАукционовСрезПоследних.Участник = АукРасчетИтоговРезультаты.Участник)
	|			И (Аук_ИсторияДанныхАукционовСрезПоследних.СтрокаДанных = АукРасчетИтоговРезультаты.СтрокаДанных)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.АукЭлементыДанныхАукционов КАК АукЭлементыДанныхАукционов
	|		ПО втСтруктураСтавкиПоАукциону.ЭлементСтавки = АукЭлементыДанныхАукционов.Ссылка
	|ГДЕ
	|	АукРасчетИтоговРезультаты.Участник = &Участник
	|	И АукРасчетИтоговРезультаты.ЭтоПобедитель
	|	И АукРасчетИтоговРезультаты.СтрокаДанных = &СтрокаДанных
	|
	|УПОРЯДОЧИТЬ ПО
	|	втСтруктураСтавкиПоАукциону.НомерСтроки";
		
	Запрос.УстановитьПараметр("Аукцион",		пСткОтбор.Аукцион);
	Запрос.УстановитьПараметр("Участник",		пСткОтбор.Участник);
	Запрос.УстановитьПараметр("СтрокаДанных",	пСткОтбор.СтрокаДанных);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ЭдоОбщийСервер.РезультатЗапросаВМассивСтруктур(РезультатЗапроса);
КонецФункции

Функция ПобедителиАукционаПоРезультатамРасчета(пАукцион, пНомерЭтапа) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукРасчетИтоговРезультаты.Участник КАК Участник,
	|	АукРасчетИтоговРезультаты.СтрокаДанных КАК СтрокаДанных
	|ИЗ
	|	РегистрСведений.АукРасчетИтоговРезультаты КАК АукРасчетИтоговРезультаты
	|ГДЕ
	|	АукРасчетИтоговРезультаты.Аукцион = &Аукцион
	|	И АукРасчетИтоговРезультаты.НомерЭтапа = &НомерЭтапа
	|	И АукРасчетИтоговРезультаты.ЭтоПобедитель";
	
	Запрос.УстановитьПараметр("Аукцион",	пАукцион);
	Запрос.УстановитьПараметр("НомерЭтапа", пНомерЭтапа);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ЭдоОбщийСервер.РезультатЗапросаВМассивСтруктур(РезультатЗапроса);
КонецФункции

Функция РезультатПромежуточногоПобедителя(пАукцион, пНомерЭтапа) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукРасчетИтоговРезультаты.РезультатРасчета КАК РезультатРасчета
	|ИЗ
	|	РегистрСведений.АукРасчетИтоговРезультаты КАК АукРасчетИтоговРезультаты
	|ГДЕ
	|	АукРасчетИтоговРезультаты.Аукцион = &Аукцион
	|	И АукРасчетИтоговРезультаты.НомерЭтапа = &НомерЭтапа
	|	И АукРасчетИтоговРезультаты.ЭтоПобедитель";	
	
	Запрос.УстановитьПараметр("Аукцион",	пАукцион);
	Запрос.УстановитьПараметр("НомерЭтапа",	пНомерЭтапа);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		
		Выборка.Следующий();
		
		Возврат Выборка.РезультатРасчета;	
	КонецЕсли;	
КонецФункции	

#КонецОбласти
